function y=myPCA(X)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%主元分析
%输入量：X的每一列代表一个样本，每一行代表样本的特征维数
%输入量：y是一个m列主元，阈值设为85%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% [X,textdata]=xlsread('E:\宋平资料\算法\核主成分分析\Book1.xls');
% X=eigenvalue_train
[m,n]=size(X);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%标准化矩阵，可以直接用zscore()来实现
%xi1=(xi-E(xi))/sqrt(var(xi)) i=1,2,..p
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
s1=mean(X,1);     %每一列的均值
for i=1:m
    X0(i,:)=X(i,:)-s1;
end
s2=std(X,0,1);    %0表示s by N-1 1表示s by N   %1表示每列的标准方差 2表示每行的标准方差
for i=1:m
    A(i,:)=X0(i,:)./s2;
end
[m1,n1]=size(A);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%协方差矩阵，可以直接用cov()来实现，
%cov(xi,yi)=sum((xi-E(x))(yi-E(y)))/(n-1)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for i=1:n1
    for j=1:n1
        r(i,j)=sum((A(:,i)-mean(A(:,i))).*(A(:,j)-mean(A(:,j))))/(m1-1);
    end
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%特征值与特征向量及排序
%可以用eig()函数得到特征值和特征向量
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
[v,d]=eig(r);
d0=diag(d)';                              %d0为特征值行向量，排序为从小到大，升序排列
m2=size(d,2);
d1=sort(d0,'descend');                    %d1为特征向量，排序从大到小，降序排列
% E=eye(size(d1));
% d0=rot90(d);
% d1=rot90(d0);
for i=1:m2
    [p,q]=find(d0==d1(:,i));
    v1(:,i)=v(:,q);
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%贡献率和积累贡献率及主元个数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
s3=sum(d1);                               %特征值求和
m3=size(d1,2);

for i=1:m3
    gx0(i)=d1(i)/s3;                        %贡献率
end
m=1;
s4=0;                                     
for i=1:m3
    gx1(i)=s4+gx0(i);                       %积累贡献率
    s4=s4+gx0(i);
    if(gx1(i)<0.85)                         %积累贡献率的判断标准85%，可以更改
        m=m+1;                              %主元个数                            
    end
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%主元
%所有原有变量经过降维处理后，即可得到主元，主元是原有变量的线性组合
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for i=1:m      %m代表主元个数
    y(:,i)=A*v1(:,i);                      %原数据经主元分析后，得到处理后的数据
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%主元模型
%主元分析法将原有的基底做了一些变换，变成另一组基底。若将原有数据
%映射到新的基底上，所得的矩阵即为主元模型
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Xn=0;
% for i=1:m
%     Xn=Xn+y(:,i)*v1(:,i)';
% end
% Xn




        
